Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/I2C_STM32F4xx.c
  i2c->info->flags = 0U;

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t ARM_I2C_PowerControl (ARM_POWER_STATE state, I2C_RESOURCES *i2c)
  \brief       Control I2C Interface Power.
  \param[in]   state  Power state
  \param[in]   i2c  Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2C_PowerControl (ARM_POWER_STATE state, I2C_RESOURCES *i2c) {

  switch (state) {
    case ARM_POWER_OFF:
      /* Enable I2C clock */
      if (i2c->reg == I2C1)      { __HAL_RCC_I2C1_CLK_ENABLE(); }
      #if (defined (I2C2) && (RTE_I2C2 != 0))
      else if (i2c->reg == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); }
      #endif
      #if (defined (I2C3) && (RTE_I2C3 != 0))
      else if (i2c->reg == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); }
      #endif
      else { return ARM_DRIVER_ERROR; }

      /* Disable I2C peripheral */
      i2c->reg->CR1 = 0;

      #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        /* Disable I2C IRQ */
        HAL_NVIC_DisableIRQ(i2c->ev_irq_num);
        HAL_NVIC_DisableIRQ(i2c->er_irq_num);

        /* Abort DMA streams and disable stream IRQs in NVIC */
        if ((i2c->info->flags & I2C_DMA_XFER) != 0U) {
          if (i2c->dma_rx->h->Instance != NULL) {
            HAL_DMA_Abort (i2c->dma_rx->h);
            HAL_NVIC_DisableIRQ (i2c->dma_rx->irq_num);
          }
          if (i2c->dma_tx->h->Instance != NULL) {
            HAL_DMA_Abort (i2c->dma_tx->h);
            HAL_NVIC_DisableIRQ (i2c->dma_tx->irq_num);
          }
        }

        /* Disable peripheral clock */
        if (i2c->reg == I2C1)      { __HAL_RCC_I2C1_CLK_DISABLE(); }
        #if (defined (I2C2) && (RTE_I2C2 != 0))
        else if (i2c->reg == I2C2) { __HAL_RCC_I2C2_CLK_DISABLE(); }
        #endif
        #if (defined (I2C3) && (RTE_I2C3 != 0))
        else if (i2c->reg == I2C3) { __HAL_RCC_I2C3_CLK_DISABLE(); }
        #endif
        else { return ARM_DRIVER_ERROR; }
      #else
        if (i2c->h->Instance != NULL) { HAL_I2C_MspDeInit (i2c->h);}
      #endif

      i2c->info->status.busy             = 0U;
      i2c->info->status.mode             = 0U;
      i2c->info->status.direction        = 0U;
      i2c->info->status.general_call     = 0U;
      i2c->info->status.arbitration_lost = 0U;
      i2c->info->status.bus_error        = 0U;

      i2c->info->flags &= ~I2C_POWER;
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      if ((i2c->info->flags & I2C_INIT)  == 0U) {
        return ARM_DRIVER_ERROR;
      }
      if ((i2c->info->flags & I2C_POWER) != 0U) {
        return ARM_DRIVER_OK;
      }
      #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        /* Enable I2C clock */
        if (i2c->reg == I2C1)      { __HAL_RCC_I2C1_CLK_ENABLE(); }
        #if (defined (I2C2) && (RTE_I2C2 != 0))
        else if (i2c->reg == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); }
        #endif
        #if (defined (I2C3) && (RTE_I2C3 != 0))
        else if (i2c->reg == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); }
        #endif
        else { return ARM_DRIVER_ERROR; }

        /* Enable DMA IRQs in NVIC */
        if ((i2c->info->flags & I2C_DMA_XFER) != 0U) {
          HAL_NVIC_EnableIRQ (i2c->dma_rx->irq_num);
          HAL_NVIC_EnableIRQ (i2c->dma_tx->irq_num);
        }

        /* Clear and Enable I2C IRQ */
        HAL_NVIC_ClearPendingIRQ(i2c->ev_irq_num);
        HAL_NVIC_ClearPendingIRQ(i2c->er_irq_num);
        HAL_NVIC_EnableIRQ(i2c->ev_irq_num);
        HAL_NVIC_EnableIRQ(i2c->er_irq_num);
      #else
        HAL_I2C_MspInit (i2c->h);
      #endif

      /* Reset the peripheral */
      if (i2c->reg == I2C1) {
        __HAL_RCC_I2C1_FORCE_RESET();
        __NOP(); __NOP(); __NOP(); __NOP(); 
        __HAL_RCC_I2C1_RELEASE_RESET();
      }
      #if defined (I2C2)
      else if (i2c->reg == I2C2) {
        __HAL_RCC_I2C2_FORCE_RESET();
        __NOP(); __NOP(); __NOP(); __NOP(); 
        __HAL_RCC_I2C2_RELEASE_RESET();
      }
      #endif
      #if defined (I2C3)
      else {
        __HAL_RCC_I2C3_FORCE_RESET();
        __NOP(); __NOP(); __NOP(); __NOP(); 
        __HAL_RCC_I2C3_RELEASE_RESET();
      }
      #endif

      /* Enable event and error interrupts */
      i2c->reg->CR2 |= I2C_CR2_ITEVTEN | I2C_CR2_ITERREN;
      /* Disable buffer interrupts */
      i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

      /* Enable clock stretching */
      i2c->reg->CR1 &= ~I2C_CR1_NOSTRETCH;

      /* Enable I2C peripheral */
      i2c->reg->CR1 |= I2C_CR1_PE;

      /* Enable acknowledge */
      i2c->reg->CR1 |= I2C_CR1_ACK;

      /* Ready for operation */
      i2c->info->flags |= I2C_POWER;

      break;
  }

  return ARM_DRIVER_OK;
}


/**
  \fn          int32_t I2C_MasterTransmit (uint32_t       addr,
                                           const uint8_t *data,
                                           uint32_t       num,
                                           bool           xfer_pending,
                                           I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Master.
  \param[in]   addr          Slave address (7-bit or 10-bit)
  \param[in]   data          Pointer to buffer with data to send to I2C Slave
  \param[in]   num           Number of data bytes to send
  \param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
  \param[in]   i2c           Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2C_MasterTransmit (uint32_t       addr,
                                   const uint8_t *data,
                                   uint32_t       num,
                                   bool           xfer_pending,
                                   I2C_RESOURCES *i2c) {
  uint32_t tick;

  if ((data == NULL) || (num == 0U)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((addr & ~((uint32_t)ARM_I2C_ADDRESS_10BIT | (uint32_t)ARM_I2C_ADDRESS_GC)) > 0x3FFU) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->info->status.busy) {
    return (ARM_DRIVER_ERROR_BUSY);
  }

  if ((i2c->info->ctrl & XFER_CTRL_XPENDING) == 0U) {
    /* New transfer */
    tick = HAL_GetTick();
    do {
      if ((i2c->reg->SR2 & I2C_SR2_BUSY) == 0U) {
        break;
      }
    } while ((HAL_GetTick() - tick) < ARM_I2C_BUSY_TIMEOUT);

