Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/I2C_STM32F4xx.c
        /* Clear ADDR flag */
        i2c->reg->SR1;
        i2c->reg->SR2;

        if (tr->ctrl & XFER_CTRL_RSTART) {
          tr->ctrl &= ~XFER_CTRL_RSTART;
          /* Generate repeated start */
          i2c->reg->CR1 |= I2C_CR1_START;
          /* Re-send direction bit */
          tr->ctrl |= XFER_CTRL_RDIR;
        }
        else {
          if (rx->num == 1U) {
            if ((tr->ctrl & XFER_CTRL_XPENDING) == 0U) {
              i2c->reg->CR1 |= I2C_CR1_STOP;
            }
          }
          else if (rx->num == 2U) {
            i2c->reg->CR1 &= ~I2C_CR1_ACK;
            i2c->reg->CR1 |=  I2C_CR1_POS;

            /* Wait until BTF == 1 */
            tr->ctrl |= XFER_CTRL_WAIT_BTF;
          }
          else {
            if (rx->num == 3U) {
              /* Wait until BTF == 1 */
              tr->ctrl |= XFER_CTRL_WAIT_BTF;
            }
          }

          tr->ctrl |= XFER_CTRL_ADDR_DONE;
        }
      }
      else {
        /* Master transmitter */

        /* Clear ADDR flag */
        i2c->reg->SR1;
        i2c->reg->SR2;

        tr->ctrl |= XFER_CTRL_ADDR_DONE;
      }

      if (tr->ctrl & XFER_CTRL_ADDR_DONE) {
        /* Slave is addressed, activate transfer */
        if ((i2c->dma_rx != NULL) && (i2c->dma_tx != NULL)) {
          /* Enable DMA data transfer */
          i2c->reg->CR2 |= I2C_CR2_DMAEN;
        }
        else {
          /* Enable IRQ data transfer */
          i2c->reg->CR2 |= I2C_CR2_ITBUFEN;
        }
      }
    }
    else {
      /* Addressed as a Slave */
      tr->state = XFER_STATE_ADDR;

      /* Clear ADDR flag */
      sr1 = (uint16_t)i2c->reg->SR1;
      sr2 = (uint16_t)i2c->reg->SR2;

      if ((sr2 & I2C_SR2_TRA) != 0U) {
        /* Slave transmitter */
        tr->status.direction = I2C_DIR_TX;
      } else {
        /* Slave receiver */
        tr->status.direction = I2C_DIR_RX;
      }

      if (sr2 & I2C_SR2_GENCALL) {
        tr->status.general_call = 1U;
      } else {
        tr->status.general_call = 0U;
      }

      if (tr->cb_event != NULL) {
        event = 0U;

        if (tr->status.general_call) {
          event |= ARM_I2C_EVENT_GENERAL_CALL;
        }

        if (tr->status.direction == I2C_DIR_TX) {
          if (tx->cnt == tx->num) {
            tr->status.busy = 0U;

            tr->cb_event (event | ARM_I2C_EVENT_SLAVE_TRANSMIT);
          }
        }
        else {
          if (rx->cnt == rx->num) {
            tr->status.busy = 0U;

            tr->cb_event (event | ARM_I2C_EVENT_SLAVE_RECEIVE);
          }
        }
      }

      /* Driver is busy */
      tr->status.busy = 1U;

      if (tr->ctrl == XFER_CTRL_XSET) {
        /* Transfer operation is set */
        if ((i2c->info->flags & I2C_DMA_XFER) != 0U) {
          /* Enable DMA data transfer */
          i2c->reg->CR2 |= I2C_CR2_DMAEN;
        }
        else {
          /* Enable IRQ data transfer */
          i2c->reg->CR2 |= I2C_CR2_ITBUFEN;
        }
      }
      else {
        /* Transfer operation was not registered */
        if (tr->status.direction == I2C_DIR_RX) {
          if ((i2c->reg->OAR1 & I2C_OAR1_ADDMODE_Msk) == 0U) {
            /* 7-bit addressing mode */
            if (tr->ctrl != XFER_CTRL_XSET) {
              /* Nothing to receive, disable ACK */
              i2c->reg->CR1 &= ~I2C_CR1_ACK;
              /* ACK will be re-enabled on STOP */
            }
          }
        }
        else {
          /* Enable buffer interrupts as BTF will not be triggered */
          i2c->reg->CR2 |= I2C_CR2_ITBUFEN;
        }
      }
    }
  }
  else if (sr1 & I2C_SR1_STOPF) {
    /* Slave receiver: STOP condition detected */
    /* Set after ACK, not set after NACK       */
    tr->state = XFER_STATE_IDLE;

    /* Reenable ACK */
    i2c->reg->CR1 |= I2C_CR1_ACK;

    tr->status.busy = 0U;

    if (tr->cb_event != NULL) {
      if ((tr->ctrl & (XFER_CTRL_XSET | XFER_CTRL_XDONE)) == XFER_CTRL_XSET) {
        event = ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_TRANSFER_INCOMPLETE;

        if (tr->status.general_call) {
          event |= ARM_I2C_EVENT_GENERAL_CALL;
        }

        tr->cb_event (event);
      }
    }
  }
  else if ((i2c->reg->CR2 & I2C_CR2_ITBUFEN) != 0U) {
    /* BTF, RxNE or TxE interrupt */
    if (tr->status.mode == I2C_MODE_MASTER) {
      /* Master transfer */

      if (sr1 & I2C_SR1_TXE) {
        /* Master transmitter */
        i2c->reg->DR = tx->data[tx->cnt];

        tx->cnt++;
        if (tx->cnt == tx->num) {
          tr->ctrl |= XFER_CTRL_XDONE;

          i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;
          /* Wait for BTF */
        }
      }
      else {
        if (sr1 & I2C_SR1_RXNE) {
          /* Master receiver */

          if ((rx->num == 1U) || (rx->num > 3U)) {
            rx->data[rx->cnt++] = (uint8_t)i2c->reg->DR;
          }

          if (rx->num == 1U) {
            /* Single byte transfer completed */
            i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

            if (tr->ctrl & XFER_CTRL_XPENDING) {
              i2c->reg->CR2 &= ~I2C_CR2_ITEVTEN;
            }
            /* (STOP was already sent during ADDR phase) */

            tr->status.busy = 0U;
            tr->status.mode = 0U;

            if (tr->cb_event) {
              tr->cb_event (ARM_I2C_EVENT_TRANSFER_DONE);
            }
          }
          else {
            if ((rx->num == 2U) || (rx->cnt == (rx->num - 3U))) {
              /* N > 2 byte reception, begin N-2 data reception */
              i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;
              /* Wait for BTF */
            }
          }
        }
      }
    }
    else {
      /* Slave transfer */
      if (sr1 & I2C_SR1_TXE) {
        /* Slave transmitter */
        tr->state = XFER_STATE_SLAVE_TX;

        if (tx->cnt < tx->num) {
          i2c->reg->DR = tx->data[tx->cnt];

          tx->cnt++;
          if (tx->cnt == tx->num) {
            tr->ctrl |=  XFER_CTRL_XDONE;
            
            i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

            tr->status.busy = 0U;

            /* Transfer completed */
            if (tr->cb_event != NULL) {
              event = ARM_I2C_EVENT_TRANSFER_DONE;

              if (i2c->info->status.general_call) {
                /* This was general call address */
                event |= ARM_I2C_EVENT_GENERAL_CALL;
              }

              tr->cb_event (event);
            }
          }
        }
        else {
          /* Nothing to send, but keep communication going */
          i2c->reg->DR = (uint8_t)0xFF;
        }
      }
      else {
        if (sr1 & I2C_SR1_RXNE) {
          /* Slave receiver */
          tr->state = XFER_STATE_SLAVE_RX;

          data = (uint8_t)i2c->reg->DR;

