Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/I2C_STM32F4xx.c
          if (rx->cnt < rx->num) {
            /* Receive data */
            rx->data[rx->cnt] = data;

            rx->cnt++;
            if (rx->cnt == rx->num) {
              tr->ctrl |= XFER_CTRL_XDONE;
              
              i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

              tr->status.busy = 0U;

              if (tr->cb_event != NULL) {
                event = ARM_I2C_EVENT_TRANSFER_DONE;

                if (tr->status.general_call) {
                  event |= ARM_I2C_EVENT_GENERAL_CALL;
                }
                tr->cb_event (event);
              }
            }
          }
        }
      }
    }
  }
  else if (((sr1 & I2C_SR1_BTF) != 0U) && ((i2c->reg->CR2 & I2C_CR2_ITBUFEN) == 0U)) {
    /* Byte Transfer Finished */
    if (tr->ctrl & XFER_CTRL_DMA_DONE) {
      if (tr->status.mode == I2C_MODE_MASTER) {
        if (tr->ctrl & XFER_CTRL_XPENDING) {
          /* Disable event interrupt */
          i2c->reg->CR2 &= ~I2C_CR2_ITEVTEN;
        }
        else {
          /* Generate stop condition */
          i2c->reg->CR1 |= I2C_CR1_STOP;
        }
        /* Dummy read, to clear BTF */
        i2c->reg->DR;

        tr->status.busy = 0U;
        tr->status.mode = 0U;

        if (tr->cb_event) {
          tr->cb_event (ARM_I2C_EVENT_TRANSFER_DONE);
        }
      }
      else {
        /* Master requests more data */
        tr->status.busy = 0U;
        tr->status.mode = 0U;

        /* Dummy read, to clear BTF */
        i2c->reg->DR;

        if (tr->cb_event != NULL) {
          event = ARM_I2C_EVENT_SLAVE_TRANSMIT;

          if (tr->status.general_call) {
            event |= ARM_I2C_EVENT_GENERAL_CALL;
          }

          tr->cb_event (event);

          if (tr->ctrl == XFER_CTRL_XSET) {
            /* Transfer was set, re-enable DMA */
            i2c->reg->CR2 |= I2C_CR2_DMAEN;
          }
        }
        
        if (tr->ctrl != XFER_CTRL_XSET) {
          /* New transfer is not set */
          i2c->reg->CR1 |= I2C_CR1_STOP;
        }
        /* Re-set transfer control flags */
        tr->ctrl |= XFER_CTRL_ADDR_DONE;
      }
    }
    else {
      if (tr->status.mode == I2C_MODE_MASTER) {
        if (sr1 & I2C_SR1_TXE) {
          /* End master transmit operation */
          if (tr->ctrl & XFER_CTRL_XPENDING) {
            i2c->reg->CR2 &= ~I2C_CR2_ITEVTEN;
          }
          else {
            i2c->reg->CR1 |= I2C_CR1_STOP;
          }
          /* Dummy read, to clear BTF */
          i2c->reg->DR;

          tr->status.busy = 0U;
          tr->status.mode = 0U;

          if (tr->cb_event) {
            tr->cb_event (ARM_I2C_EVENT_TRANSFER_DONE);
          }
        }
        else {
          if (sr1 & I2C_SR1_RXNE) {
            /* End master receiver operation */
            if ((rx->num == 2U) || (rx->cnt == (rx->num - 2U))) {
              /* Two bytes remaining */
              if (tr->ctrl & XFER_CTRL_XPENDING) {
                i2c->reg->CR2 &= ~I2C_CR2_ITEVTEN;
              }
              else {
                i2c->reg->CR1 |= I2C_CR1_STOP;
              }

              /* Read data N-1 and N */
              rx->data[rx->cnt++] = (uint8_t)i2c->reg->DR;
              rx->data[rx->cnt++] = (uint8_t)i2c->reg->DR;

              tr->status.busy = 0U;
              tr->status.mode = 0U;

              i2c->reg->CR1 &= ~I2C_CR1_POS;

              if (tr->cb_event) {
                tr->cb_event (ARM_I2C_EVENT_TRANSFER_DONE);
              }
            }
            else {
              /* Three bytes remaining */
              i2c->reg->CR1 &= ~I2C_CR1_ACK;
              /* Read data N-2 */
              rx->data[rx->cnt++] = (uint8_t)i2c->reg->DR;
            }
          }
        }
      }
      else {
        if (sr1 & I2C_SR1_TXE) {
          /* Slave transmitter */
          if ((tr->state == XFER_STATE_SLAVE_TX) && ((tr->ctrl & XFER_CTRL_XDONE) != 0U)) {
            /* Master requests mode data */
            if (tr->cb_event != NULL) {
              event = ARM_I2C_EVENT_SLAVE_TRANSMIT;

              if (tr->status.general_call) {
                event |= ARM_I2C_EVENT_GENERAL_CALL;
              }

              tr->cb_event (event);

              if (tr->ctrl == XFER_CTRL_XSET) {
                /* Transfer was set, re-enable buffer interrupts */
                i2c->reg->CR2 |= I2C_CR2_ITBUFEN;

                /* Re-set transfer control flags */
                tr->ctrl |= XFER_CTRL_ADDR_DONE;
              }
            }
          }
        }
        else {
          if (sr1 & I2C_SR1_RXNE) {
            if ((i2c->reg->OAR1 & I2C_OAR1_ADDMODE_Msk) != 0U) {
              /* 10-bit addressing mode, disable ACK */
              i2c->reg->CR1 &= ~I2C_CR1_ACK;
              /* ACK will be re-enabled on STOP */
            }
            /* Keep communication going */
            data = (uint8_t)i2c->reg->DR;
          }
        }
      }
    }
  }
}


/**
  \fn          void I2C_ER_IRQHandler (I2C_RESOURCES *i2c)
  \brief       I2C Error Interrupt handler.
  \param[in]   i2c  Pointer to I2C resources
*/
static void I2C_ER_IRQHandler (I2C_RESOURCES *i2c) {
  I2C_INFO *tr = i2c->info;
  uint32_t sr1 = i2c->reg->SR1;
  uint32_t evt = 0U;
  uint32_t err = 0U;

  if (sr1 & I2C_SR1_SMBALERT) {
    /* SMBus alert */
    err |= I2C_SR1_SMBALERT;
  }
  if (sr1 & I2C_SR1_TIMEOUT) {
    /* Timeout - SCL remained LOW for 25ms */
    err |= I2C_SR1_TIMEOUT;
  }
  if (sr1 & I2C_SR1_PECERR) {
    /* PEC Error in reception */
    err |= I2C_SR1_PECERR;
  }
  if (sr1 & I2C_SR1_OVR) {
    /* Overrun/Underrun */
    err |= I2C_SR1_OVR;
  }

  if (sr1 & I2C_SR1_AF) {
    /* Acknowledge failure - NACK received */
    err |= I2C_SR1_AF;

    if (tr->status.mode == I2C_MODE_MASTER) {
      /* Disable buffer interrupts */
      i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

      /* Resets the communication */
      i2c->reg->CR1 |= I2C_CR1_STOP;

      evt = ARM_I2C_EVENT_TRANSFER_DONE;

      if ((i2c->info->ctrl & XFER_CTRL_ADDR_DONE) == 0U) {
        /* Addressing not done */
        evt |= ARM_I2C_EVENT_ADDRESS_NACK;
      }

      if ((i2c->info->ctrl & XFER_CTRL_XDONE) == 0U) {
        /* Transfer did not complete */
        evt |= ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
      }

      if (i2c->info->status.general_call) {
        /* This was generall call address */
        evt |= ARM_I2C_EVENT_GENERAL_CALL;
      }

      tr->tx.num = 0U;
      tr->ctrl   = 0U;

      tr->status.busy = 0U;
      tr->status.mode = 0U;
    }
    else {
      /* Slave received NACK */
      if ((tr->flags & I2C_DMA_XFER) == 0U) {
        /* Disable buffer interrupts */
        i2c->reg->CR2 &= ~I2C_CR2_ITBUFEN;

        if ((tr->ctrl & (XFER_CTRL_XSET | XFER_CTRL_XDONE)) == XFER_CTRL_XSET) {
          /* Transfer was set, but did not complete */
          evt = ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_TRANSFER_INCOMPLETE;

          if (i2c->info->status.general_call) {
            /* This was general call address */
            evt |= ARM_I2C_EVENT_GENERAL_CALL;
          }

